end-to-end/artillery/skip-scenarios/portal-details.yml
config:
  target: "https://portal.stage.hubmapconsortium.org"
  phases:
    - duration: 5 # seconds
      arrivalRate: "{{ $processEnvironment.RATE }}" # scenarios started per second
  processor: "./helper.js"
scenarios:
  - flow:
      - get:
          url: "/browse/dataset/a11fe9d14122d4254acfefc9bf9faae4"
          gzip: true
          afterResponse: "printStatus"
      - get:
          url: "/browse/sample/9be76ec5639c4e2f18fcf734bea7b4e1"
          gzip: true
          afterResponse: "printStatus"
      - get:
          url: "/browse/donor/2510644405f4e7fd86d31af0001b840f"
          gzip: true
          afterResponse: "printStatus"