end-to-end/artillery/skip-scenarios/portal-docs.yml
config:
  target: "https://portal.stage.hubmapconsortium.org"
  phases:
    - duration: 5 # seconds
      arrivalRate: "{{ $processEnvironment.RATE }}" # scenarios started per second
  processor: "./helper.js"
scenarios:
  - flow:
      - get:
          url: "/CHANGELOG"
          gzip: true
          afterResponse: "printStatus"