end-to-end/artillery/skip-scenarios/search.yml
config:
  target: "https://search-api.stage.hubmapconsortium.org"
  phases:
    - duration: 5 # seconds
      arrivalRate: "{{ $processEnvironment.RATE }}" # scenarios started per second
  processor: "./helper.js"
scenarios:
  - flow:
      - post:
          url: "/portal/search"
          headers:
            "Content-Type": application/json
          body: "{{ $processEnvironment.DATA_TYPES_QUERY }}"
          gzip: true
          afterResponse: "printStatus"
      - post:
          url: "/portal/search"
          headers:
            "Content-Type": application/json
          body: "{{ $processEnvironment.ENTITY_TYPES_QUERY }}"
          gzip: true
          afterResponse: "printStatus"
      - post:
          url: "/portal/search"
          headers:
            "Content-Type": application/json
            "Authorization": "Bearer {{ $processEnvironment.GROUPS_TOKEN }}"
          body: "{{ $processEnvironment.DATASETS_QUERY }}"
          gzip: true
          afterResponse: "printStatus"